In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\aravind\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\aravind\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\aravind\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\aravind\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in c:\users\aravind\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

In [2]:
import pandas as pd

In [3]:
name=["aravind","akil","arjun","dos","bhavanishankar"]
age=[22,23,24,25,23]

In [4]:
di={"Name":name,"Age":age}

In [5]:
df=pd.DataFrame(di)

In [6]:
df

             Name  Age
0         aravind   22
1            akil   23
2           arjun   24
3             dos   25
4  bhavanishankar   23

In [7]:
index=["Rank1","Rank2","Rank3","Rank4","Rank5",]

In [8]:
df=pd.DataFrame(di,index=index)

In [9]:
df

                 Name  Age
Rank1         aravind   22
Rank2            akil   23
Rank3           arjun   24
Rank4             dos   25
Rank5  bhavanishankar   23

In [10]:
df["Name"]

Rank1           aravind
Rank2              akil
Rank3             arjun
Rank4               dos
Rank5    bhavanishankar
Name: Name, dtype: object

In [11]:
#single dimensional array structure if there is either one row or one column then it is called as data series
type(df["Name"])

pandas.core.series.Series

In [12]:
df.Age

Rank1    22
Rank2    23
Rank3    24
Rank4    25
Rank5    23
Name: Age, dtype: int64

In [13]:
gender=["m","m","m","m","m"]

In [14]:
df["Gender"]=gender

In [15]:
df

                 Name  Age Gender
Rank1         aravind   22      m
Rank2            akil   23      m
Rank3           arjun   24      m
Rank4             dos   25      m
Rank5  bhavanishankar   23      m

In [16]:
del df["Age"]

In [17]:
df

                 Name Gender
Rank1         aravind      m
Rank2            akil      m
Rank3           arjun      m
Rank4             dos      m
Rank5  bhavanishankar      m

In [18]:
df.pop("Name")

Rank1           aravind
Rank2              akil
Rank3             arjun
Rank4               dos
Rank5    bhavanishankar
Name: Name, dtype: object

In [19]:
df

      Gender
Rank1      m
Rank2      m
Rank3      m
Rank4      m
Rank5      m

The difference between delete and pop  is pop returnt the deleted element where as delete just delete the specifed content